[
  {
    "title": "Easy usage",
    "content": "Using our easy-to-navigate platform, travelers can effortlessly secure insurance for their upcoming trips. By entering their travel details and selecting the coverage options they prefer, they can instantly receive accurate quotes. Our unique algorithm assesses factors like destination risks, flight routes, and historical trends to provide a tailored insurance solution. This ensures travelers get fair and customized premiums based on the specific risks associated with their journey.",
    "videoUrl": "/videos/application-ease.mp4"
  },
  {
    "title": "Everything on chain with ChainLink",
    "content": "At WingSurance, we use Chainlink's secure and decentralized oracle network to collect real-time travel data. Our algorithm cross-references this data with the details of the insured flight to determine if the reported issues align with the actual travel conditions. If the data indicates that the flight disruption was caused by factors outside the traveler’s control, we immediately provide coverage. However, if there is a dispute with the algorithm’s assessment, our judge protocol is activated to resolve any inconsistencies and ensure a fair resolution.",
    "videoUrl": "/videos/chainlink-blur-bg.mp4"
  },
  {
    "title": "Trust, inspired by our past endavours",
    "content": "Transparency and trust are fundamental to our mission. By harnessing the power of blockchain technology, we ensure full transparency throughout the flight insurance process. Every action, from the moment a policy is purchased to the resolution of a claim, is recorded on the blockchain, creating a secure and traceable record. Additionally, by utilizing Chainlink's trusted and secure oracle network, we further bolster the integrity of our platform, guaranteeing that travelers can rely on the fairness and transparency of the insurance services we offer.",
    "videoUrl": "/videos/trust-security.mp4"
  },
  {
    "title": "Empowerment done right, action without words",
    "content": "At WingSurance, we are dedicated to empowering travelers, reducing risks, and promoting safe travel experiences. We believe that by leveraging the power of blockchain and smart contract technology, we can revolutionize the flight insurance industry, making it more accessible, efficient, and inclusive for travelers around the globe.",
    "videoUrl": "/videos/big.mp4"
  }
]
